app/Controllers/Admin.php

SELECT *
FROM `parkir`
WHERE `parkir`.`id` = '102'
---
    public function checkout($id)
    {
        $parkir = $this->parkirModel->find($id);