app/Models/ParkirModel.php

SELECT *
FROM `parkir`
WHERE `status` = 'aktif'
ORDER BY `waktu_masuk` DESC
---
    public function getAktifParkir()
    {
        return $this->where('status', 'aktif')
                    ->orderBy('waktu_masuk', 'DESC')
                    ->findAll();

UPDATE `parkir` SET `waktu_keluar` = '2026-04-15 09:32:08', `durasi_menit` = 129369, `biaya` = 4317000, `status` = 'selesai', `updated_at` = '2026-04-15 09:32:08'
WHERE `parkir`.`id` IN ('102')
---
    public function checkoutParkir($id, $data)
    {
        return $this->update($id, $data);

SELECT DATE(waktu_masuk) as tanggal, COUNT(*) as total_transaksi, SUM(biaya) as total_pendapatan, MONTH(waktu_masuk) as bulan, YEAR(waktu_masuk) as tahun
FROM `parkir`
WHERE `waktu_masuk` >= '2026-03-16 00:00:00'
AND `waktu_masuk` <= '2026-04-15 23:59:59'
AND `status` = 'selesai'
GROUP BY YEAR(waktu_masuk), MONTH(waktu_masuk)
ORDER BY `tanggal` DESC
---
    public function getLaporan($startDate, $endDate, $groupBy = 'daily')
    {
        $builder = $this->builder();

        $builder->select('DATE(waktu_masuk) as tanggal, COUNT(*) as total_transaksi, SUM(biaya) as total_pendapatan')
                ->where('waktu_masuk >=', $startDate)
                ->where('waktu_masuk <=', $endDate)
                ->where('status', 'selesai');

        if ($groupBy === 'daily') {
            $builder->groupBy('DATE(waktu_masuk)');
        } elseif ($groupBy === 'weekly') {
            $builder->select('WEEK(waktu_masuk) as minggu, YEAR(waktu_masuk) as tahun', false);
            $builder->groupBy('YEAR(waktu_masuk), WEEK(waktu_masuk)');
        } elseif ($groupBy === 'monthly') {
            $builder->select('MONTH(waktu_masuk) as bulan, YEAR(waktu_masuk) as tahun', false);
            $builder->groupBy('YEAR(waktu_masuk), MONTH(waktu_masuk)');
        }

        $builder->orderBy('tanggal', 'DESC');

        return $builder->get()->getResultArray();

SELECT COUNT(*) AS `numrows`
FROM `parkir`
WHERE `status` = 'aktif'
SELECT COUNT(*) AS `numrows`
FROM `parkir`
WHERE DATE(waktu_masuk) = '2026-04-15'
SELECT SUM(`biaya`) AS `biaya`
FROM `parkir`
WHERE DATE(waktu_masuk) = '2026-04-15'
AND `status` = 'selesai'
 LIMIT 1
SELECT SUM(`biaya`) AS `biaya`
FROM `parkir`
WHERE `waktu_masuk` >= '2026-04-08'
AND `status` = 'selesai'
 LIMIT 1
SELECT SUM(`biaya`) AS `biaya`
FROM `parkir`
WHERE `waktu_masuk` >= '2026-04-01'
AND `status` = 'selesai'
 LIMIT 1
---
    public function getDashboardStats()
    {
        $today = date('Y-m-d');
        $thisWeek = date('Y-m-d', strtotime('-7 days'));
        $thisMonth = date('Y-m-01');

        return [
            'aktif' => $this->where('status', 'aktif')->countAllResults(),
            'today' => $this->where('DATE(waktu_masuk)', $today)->countAllResults(),
            'today_revenue' => $this->selectSum('biaya')
                                   ->where('DATE(waktu_masuk)', $today)
                                   ->where('status', 'selesai')
                                   ->first()['biaya'] ?? 0,
            'week_revenue' => $this->selectSum('biaya')
                                  ->where('waktu_masuk >=', $thisWeek)
                                  ->where('status', 'selesai')
                                  ->first()['biaya'] ?? 0,
            'month_revenue' => $this->selectSum('biaya')
                                   ->where('waktu_masuk >=', $thisMonth)
                                   ->where('status', 'selesai')
                                   ->first()['biaya'] ?? 0,
        ];